{
  "timeline": [
    {
      "title": "McLaren finish 2024 on top of the world ",
      "subtitle": "",
      "text": "McLaren win their first constructors' since 1998. Norris delivered the required victory, which is just as well with his team mate out of the picture after first lap contact with the other world champion.\n\n\nIt's been quite the year for the papaya team, and while they have time to celebrate in style, soon work begins to do it all again next year.\n\n\n2025 awaits - and it should be absolutely epic.\n\n\nThank you all for your company this year, we will be back with live coverage of every session next year but for now, make sure you stay tuned to Formula1.com for all the news, analysis and interviews from a brilliant last race of the year."
    },
    {
      "title": "So, what awaits?",
      "subtitle": "",
      "text": "There is a Pirelli tyre test next week, which some of the current grid are turning out for - a few of them for their new teams. But aside from that, the cars will be lying dormant for Christmas, with the all-new launch night in London the next time we will see the challenges.\n\n\nThen comes pre-season testing at the end of February, before the season kicks off on the 16th March in Australia."
    },
    {
      "title": "All change for 2025",
      "subtitle": "",
      "text": "Hamilton in a red race suit, four rookies on the grid... And potentially, four teams in the mix for the constructors' title, and even more for the drivers'.\n\n\nGiven their late season form, McLaren right now have to go into next season as favourites for both titles, and they could well be the only top team fielding an unchanged line up too."
    },
    {
      "title": "An update on Perez",
      "subtitle": "",
      "text": "And one final bit of housekeeping. Perez spoke to the media earlier on, after his DNF. Asked yet again if he will be on the grid next season, he gave his biggest hint that the curtains might be closing on his F1 career.\n\n\n\"I’ve got a contract to drive next year so it will be down to reaching an agreement hopefully. See what the team wants to do,\" he said.\n\n\n\"I think we know how difficult this year has been so I think it’s just a matter of discussing what’s best for everyone going forwards. We’ll see what happens.\""
    },
    {
      "title": "Piastri also up for the fight ",
      "subtitle": "",
      "text": "Not the last race of 2024 he would have wanted, but Piastri has just made it very clear he is up for the fight in 2025.\n\n\n\"Definitely,\" is his take on whether he will be fighting for the title next year. He's not interested in being relegated to the number two spot, just because his team mate took more wins this year..."
    },
    {
      "title": "Some housekeeping ",
      "subtitle": "",
      "text": "The penalties continue - Bottas has been handed a five-place grid drop for crashing into Magnussen. Will he ever get to serve that penalty? Much could depend on whether F1's 11th team opt for some experience in their line up when they enter in 2026...\n\n\nStroll was handed a late time penalty too, for exceeding track limits."
    },
    {
      "title": "Let's not forget Hamilton ",
      "subtitle": "",
      "text": "Leclerc won driver of the day with his drive from P19 to third. But Hamilton's drive was just an impressive, 16th on the grid starting on the hard compound tyre, to fourth at the flag with a last lap overtake of his team mate.\n\n\nNo final podium for the Silver Arrows, but at least after yesterday's disappointment, he goes out on a bit of a high."
    },
    {
      "title": "McLaren's night ",
      "subtitle": "",
      "text": "Tonight belongs to McLaren, Norris delivering a fourth win of the year. But the season in terms of the drivers' title still belongs to Verstappen. In the end, he won with a couple of races to spare - and it would be remiss not to celebrate his achievements this season."
    },
    {
      "title": "What else to say?",
      "subtitle": "",
      "text": "That was quite some race - collisions, retirements, penalties galore.\n\n\nInterestingly though, the front four teams were all in the mix, Verstappen quite possibly quicker than he could show due to the time penalty he received for colliding with Piastri at the start.\n\n\nAnd that bodes very, very well for next year, the last year of the current regulations, so very much a continuation of the current spec cars."
    },
    {
      "title": "The fizz comes out ",
      "subtitle": "",
      "text": "Drinks all round as the top three spray each other, have a slurp and pat each other on the back. These three get on well, and it shows.\n\n\nBelow the podium, the men and women in papaya are hugging each other as more fireworks go off overhead."
    },
    {
      "title": "Time for the podium ",
      "subtitle": "",
      "text": "Norris is on the top step, flanked by his former team mate and likely title rival for 2025. And a Norris podium means one thing - we will be having one last bottle smashing celebration imminently after the trophies are presented.\n\n\nZak Brown is on the podium to take the winning trophy for McLaren, and he runs to the front of the rostrum to gesture to his team below.\n\n\nWhat a turnaround, what a story this is for McLaren."
    },
    {
      "title": "The cooldown room ",
      "subtitle": "",
      "text": "You can't get these guys to relax - the season is done, the 2024 cars will be packed up for evermore, and yet the top three are discussing tyres, pace and tactics during the race.\n\n\nNorris wants to know how Leclerc made up so many places at the start, with the Monegasque driver modestly saying a lot of it was luck."
    },
    {
      "title": "Emotions for Hamilton ",
      "subtitle": "",
      "text": "We've just heard Hamilton's across the line radio, which we'll bring you if we can. Safe to say it is laden with emotion.\n\n\nThe most successful driver - team partnership in the history of F1 has drawn to a close, and what an era that was."
    },
    {
      "title": "An interesting night awaits ",
      "subtitle": "",
      "text": "Norris admitted that he is planning to.... Well, have several drinks tonight with Zak Brown to celebrate. So, that's what McLaren are up to, and you'd imagine a few other drivers might join in with that party - with some well deserved drinks at the end of the longest F1 season in history."
    },
    {
      "title": "Plenty of emotion on the main straight ",
      "subtitle": "",
      "text": "Norris has been with his crew, Hamilton stood on the nose of his car to salute the crowd before being given a bear hug by Zak Brown, and Leclerc looks so, so disappointed.\n\n\nHe was crowned driver of the day, but it is scant consolation. Sainz is quick to congratulate his golfing buddy Norris, before Hamilton comes to shake the hand of the man whose seat he is taking for next year."
    },
    {
      "title": "The top 10",
      "subtitle": "",
      "text": "Norris from Sainz and Leclerc.\n\n\nHamilton an incredible fourth from p16 on the grid, ahead of his team mate.\n\n\nVerstappen's fourth title ends with a drive to P6, ahead of Gasly, Hulkenberg, Alonso and Piastri."
    },
    {
      "title": "The fireworks go off ",
      "subtitle": "",
      "text": "As the night sky lights up with a colourful array of fireworks, on the main straight Hamilton is doing donuts to the delight of the crowd.\n\n\nNorris is out of the car and celebrating with the team, on quite the night for McLaren"
    },
    {
      "title": "'Next year is going to be my year' - Norris finishes on top",
      "subtitle": "",
      "text": "It's Norris' fourth win of the year, and that 25 point reward was enough for McLaren. Norris is clear though, he's coming for the drivers' title next year.\n\n\nAs for Ferrari, a double podium is just reward, they gave it a good go and made it tight, but just came up short."
    },
    {
      "title": "McLaren are champions of the world ",
      "subtitle": "",
      "text": "A first constructors' title for McLaren this century, 26 years after their last.\n\n\nIt's taken both drivers to do it, Norris and Piastri both contributing wins, Sprint victories and plenty of podiums. Consistency was key too, with Piastri finishing outside the points just once all year as he made it to the chequered flag in every race, while Norris did likewise bar in Austria, when he failed to finish after his crash with Verstappen.\n\n\nOnly a few years after McLaren struggled down the back of the field, their turnaround has been truly remarkable."
    },
    {
      "title": "Norris wins the final race of the year!",
      "subtitle": "",
      "text": "It's victory for Lando Norris, his fourth of the season. And that means his team win the constructors' champions.\n\n\nBut behind Hamilton gets Russell into Turn 10! One last overtake for the Mercedes man puts him into fourth.\n\n\nSainz crosses for second, Leclerc is a 'miraculous' third and Hamilton fourth from P16 on the grid."
    },
    {
      "title": "Last lap of the season ",
      "subtitle": "LAP 58/58",
      "text": "Can anything else happen on the last lap of the year? Yes! The yellow flags are out and Lawson has stopped out on track!\n\n\nLawson hops out of a smoking Rb, that is gently trying to roll away..."
    },
    {
      "title": "Onto the penultimate lap ",
      "subtitle": "LAP 57/58",
      "text": "Can Hamilton have one last hurrah for Mercedes? Russell has been told to keep this \"super clean,\" which unless that's in code, means the duo can fight here. The gap is 1.2s now. They are fighting for fourth place."
    },
    {
      "title": "Norris on cruise control ",
      "subtitle": "LAP 56/58",
      "text": "Norris leads by 7.6s, at a track that was expected to suit the Ferrari. McLaren have built a mighty car, and those upgrades have been nothing but top notch this year. What might have been, if only they'd started as strongly as they finished.\n\n\nFurther back, Hamilton is 1.6s further back."
    },
    {
      "title": "Where is Hamilton?",
      "subtitle": "LAP 55/58",
      "text": "Hamilton is now just 3.6s behind Russell. Could team orders come into play? With a further six seconds to make up to Leclerc, it looks unlikely Hamilton would get there on his fresher tyres, so Mercedes might leave their drivers to fight..."
    },
    {
      "title": "Piastri might be on for points ",
      "subtitle": "LAP 54/58",
      "text": "Piastri has closed up to the back of Alonso, and is into the points! It isn't a crucial point in terms of the championship, but for pride's sake... Not that the Aussie will remember this race particularly fondly."
    },
    {
      "title": "Norris cruising to the win ",
      "subtitle": "LAP 53/58",
      "text": "There's been plenty of drama behind, but up front this has been the Lando Norris show. He's led from pole tonight, via one pit stop and managed to get a good enough getaway to avoid the melee behind on the opening lap.\n\n\nMcLaren knew a win was enough, they wanted the 1-2, but they would more than settle for this."
    },
    {
      "title": "Ferrari come out into the pits ",
      "subtitle": "LAP 52/58",
      "text": "No, no - it was a trap, but no one fell for it. In come the Ferrari mechanics, with Sainz and Leclerc still out. They are not going to win the constructors' as it stands, can they do anything else?\n\n\nAh - the mechanics were out for Sainz, who ran over something, but decided he is okay to continue."
    },
    {
      "title": "Hamilton's charge continues ",
      "subtitle": "LAP 51/58",
      "text": "Hamilton needs to pick off Magnussen - who is a lap down via three pit stops and one collision - before chasing down his team mate for fourth. The gap is six seconds now.\n\n\nVerstappen looks too far back to make it up to his former rival, although he too is on quite fresh tyres, albeit the hard compound."
    },
    {
      "title": "Norris starts to lap cars ",
      "subtitle": "LAP 50/58",
      "text": "This might cost him a few tenths, Norris picking his way past some cars. He's about to lap his team mate, but he might then be able to tow Piastri up to the back of Alonso in P10.\n\n\nGasly, Hulkenberg, Albon and Alonso are the cars on for points from the midfield tonight."
    },
    {
      "title": "VOTE: Driver of the Day",
      "subtitle": "",
      "text": "It's time to vote for your Driver of the Day. Who is it to be - the leader, someone who has roared back through the field, maybe someone who is defying expectations out there?\n\n\nWhoever you want to choose, you can vote for them here. [https://www.formula1.com/en/vote.html]"
    },
    {
      "title": "What are the gaps?",
      "subtitle": "LAP 49/58",
      "text": "Norris leads by nearly six seconds from Sainz, who is 21s ahead of Leclerc - but the pit lane loss time here is quite sizeable. Russell is 5.3s back on Leclerc, and Hamilton is now under eight seconds back, on tyres that are seven laps fresher and also quicker.\n\n\nPiastri has just made his way past Tsunoda for P11."
    },
    {
      "title": "Will there be a late Safety Car?",
      "subtitle": "LAP 48/58",
      "text": "We've had a VSC, along with numerous crashes, spins and penalties. Three cars are out - Perez, Colapinto and Bottas. Is there any more drama left in the 2024 season?\n\n\nThe tyres might have a say in this, Leclerc's tyres are coming back to him slightly and he is running in free air which helps."
    },
    {
      "title": "Norris builds his lead",
      "subtitle": "LAP 47/58",
      "text": "Norris leads by 5.8s, so will Ferrari roll the dice and pit a driver? Second and third is not enough.\n\n\nFurther back, Hamilton is now just 10s behind his team mate - so he should catch Russell before the end of the race."
    },
    {
      "title": "Late drama beckons ",
      "subtitle": "LAP 46/58",
      "text": "Uh oh. Leclerc's tyres are going off - and his rubber is 25 laps old. Sainz's are 20 laps old, Norris' 19 laps old. Could there be any late, late drama?\n\n\nFurther back Piastri runs wide after a big snap, so there is some drama immediately. He is down in P12."
    },
    {
      "title": "Hamilton takes a second out of Russell",
      "subtitle": "LAP 45/58",
      "text": "Bono told Hamilton he had a cunning plan. Quite what that was remains to be seen. Hamilton is driving faster than Russell and is eating into the gap, but not fast enough. That's for fourth though, unless anyone trips up, and it doesn't look like being Norris, who hasn't put a foot wrong."
    },
    {
      "title": "Verstappen gets Hulkenberg ",
      "subtitle": "LAP 44/58",
      "text": "Up to seventh for the world champion, who has picked off Hulkenberg into Turn 6 using DRS. He has former team mate Gasly next up the road.\n\n\nThe podium is long gone for Gasly - but he's still doing enough to ensure Alpine get P6 tonight."
    },
    {
      "title": "Norris leads the race ",
      "subtitle": "LAP 43/58",
      "text": "The laps are ticking down fast, but not fast enough for Norris. he must be desperate to see the chequered flag tonight, and win for his team.\n\n\nHamilton picks off Gasly, and is told he has a 14s gap to make up on Russell. Interestingly, he is encouraged \"you can do it\" which considering it's his team mate up ahead.... Mercedes are allowing their drivers to fight tonight."
    },
    {
      "title": "Magnussen pits for softs ",
      "subtitle": "LAP 42/58",
      "text": "Haas have opted to shove Magnussen onto softs, in a bid to keep hold of the fastest lap, and deny Alpine or anyone else the chance to grab the bonus point. Haas can't score it, as Magnussen is out of the top 10 but they can deny Alpine the opportunity."
    },
    {
      "title": "Hamilton gets Hulkenberg ",
      "subtitle": "LAP 41/58",
      "text": "Hamilton flies past Hulkenberg for sixth place, and Gasly ahead is only two seconds up the road. Fifth is doable here for the seven-time world champion, but fourth might be a tough ask given it is his team mate up the road."
    },
    {
      "title": "Alonso pitted again ",
      "subtitle": "LAP 40/58",
      "text": "Alonso's second pit stop has dropped him out of the points. But who will be better off late on - those hanging on to older tyres, or those with time to make up after two stops?\n\n\nA variety of strategies on show tonight, and there is a long way to go."
    },
    {
      "title": "Piastri makes a move ",
      "subtitle": "LAP 39/58",
      "text": "Piastri gets past Stroll, who has had a very tricky seond half to the season. P14 for the Aussie then, with Doohan on debut next up.\n\n\nFurther up the field, Hulkenberg's seven second lead over Hamilton has been cut to just over two seconds."
    },
    {
      "title": "Norris increases his lead",
      "subtitle": "LAP 38/58",
      "text": "The man who has barely been mentioned is Norris, who has led from pole tonight and has a 3.5s buffer to Sainz.\n\n\nIt's enough for McLaren, but they can't afford for Norris to slide backwards or have any issues here."
    },
    {
      "title": "Who else is on for points?",
      "subtitle": "LAP 37/58",
      "text": "Alonso is holding onto P9 right now, ahead of Alex Albon - the only Williams left running. A point tonight won't matter in the championship, but it would be just reward for a team who have been under the cosh of late with so many crashes, and other one tonight.\n\n\nZhou is P11, with Piastri's recovery drive stalling in P15."
    },
    {
      "title": "Hamilton chasing down Hulkenberg ",
      "subtitle": "LAP 36/58",
      "text": "Hulkenberg said this wasn't a one-stop race, but pit again and he'll lose out big time. He might have to hang onto his hards, with a seven second buffer to Hamilton behind who is flying.\n\n\nUp front, Norris has eked out a second on Sainz, as the Ferrari man's rubber starts to wear thin."
    },
    {
      "title": "Hamilton pits from P3",
      "subtitle": "LAP 35/58",
      "text": "In comes Hamilton, his wait for a Safety Car proves fruitless. But he will be on the faster medium compound for the rest of the night.\n\n\nHe comes out seventh, ahead of Alonso. Watch out Hulkenberg and Gasly ahead."
    },
    {
      "title": "Back to the constructors' fight ",
      "subtitle": "LAP 34/58",
      "text": "Norris leads by 2.3s from Sainz, with Hamilton quite far back in third and still yet to pit.\n\n\nLeclerc is fourth and on for a podium here, but it still wouldn't be enough for Ferrari. A win is enough for McLaren to take the title."
    },
    {
      "title": "An eventful race already ",
      "subtitle": "LAP 33/58",
      "text": "It's always fun, the last race - nothing to lose, and some interesting moves as a result.\n\n\nGasly is sixth, Hulkenberg seventh in the fight for P6 in the constructors' - their team mates are out of the reckoning.\n\n\nFurther back, Piastri pits and serves his penalty - we said he'd already served it, but he hadn't as he pitted before receiving it.\n\n\nThat drops him down to P15."
    },
    {
      "title": "Bottas is limping back",
      "subtitle": "LAP 32/58",
      "text": "Both drivers are trying to limp back to the pits - Magnussen has made it in and back out, but Bottas is still trying to crawl back.\n\n\nThere is a lot of debris out there... but no sign of a Safety Car.\n\n\nOh dear, Kick Sauber have given up the ghost here and Bottas is out of his last race."
    },
    {
      "title": "So, how is the top 10 looking?",
      "subtitle": "LAP 31/58",
      "text": "Norris leads, as he has done since the start. Sainz is second, Hamilton third - but before the Mercedes fans get excited, he has yet to pit.\n\n\nBut could there be drama, Bottas is going slowly with a puncture. Replays show Bottas locked up and ran straight into the side of Magnussen!"
    },
    {
      "title": "Verstappen pits ",
      "subtitle": "LAP 30/58",
      "text": "Verstappen pits, and serves his penalty to boot. he comes back out... P11. So, time to recover some places again then for him.\n\n\nMagnussen has pitted a second time, after Hulkenberg radioed to say this is absolutely not a one-stop race."
    },
    {
      "title": "Sainz chasing hard ",
      "subtitle": "LAP 29/58",
      "text": "Sainz made up a second in the pit stop period by stopping earlier, and he is just 2.2s behind Norris and doing everything he can to close the gap.\n\n\nLawson is now under investigation, with everyone having pitted except Hamilton and Verstappen."
    },
    {
      "title": "Russell comes out behind Gasly",
      "subtitle": "LAP 28/58",
      "text": "Those two were in the fight for the podium earlier, and somehow Gasly did get ahead by stopping that bit earlier. But he can't stay ahead, as soon as Russell's tyres were up to temperature, he makes his way past.\n\n\nBut both have been overtaken by Leclerc in the pits.\n\n\nAnd Colapinto is called in to retire his car."
    },
    {
      "title": "Norris pits from the lead!",
      "subtitle": "LAP 27/58",
      "text": "They can be a little steady - but they can't afford a mistake. Oh McLaren! It's a brilliant 2.0s pit stop, and Norris returns in the lead...\n\n\nRussell behind had a 2.4s stop, and comes out in seventh."
    },
    {
      "title": "Lawson comes back in as Sainz pits from P2 ",
      "subtitle": "LAP 26/58",
      "text": "Uh oh - as well as the penalty that is a second pit stop, Lawson will likely be looked at by the stewards as well for that loose wheel.\n\n\nIn comes Sainz from second though, and it is a very tidy 2.2s stop. he comes out in third, behind Russell."
    },
    {
      "title": "Leclerc gets Gasly",
      "subtitle": "LAP 25/58",
      "text": "Good news for Ferrari - Leclerc has picked off Gasly, on merit. But there's disaster behind, Lawson radios to say \"the wheels aren't on mate!\"\n\n\nHe's crawling round, trying to get back to the pits..."
    },
    {
      "title": "Lawson gets picked off",
      "subtitle": "LAP 24/58",
      "text": "Gasly gets past Lawson, Leclerc follows suit a couple of corners later and now Lawson pits, after his team mate eventually came in on the previous lap.\n\n\nGasly is up to sixth, Leclerc seventh. The battle for the podium tonight looks tasty."
    },
    {
      "title": "RB hanging onto their mediums ",
      "subtitle": "LAP 23/58",
      "text": "Tsunoda and Lawson have yet to pit, pretty much alone amongst the midfield.\n\n\n\"Stay out,\" Tsunoda is told. \"Why?\" comes the very tired, slightly exasperated sounding reply.\n\n\nLawson is sixth, Tsunoda P10 right now."
    },
    {
      "title": "Leclerc pits for Ferrari ",
      "subtitle": "LAP 22/58",
      "text": "Leclerc pits from fourth, and comes back out in eighth ahead of Hulkenberg. Norris still leads from Sainz and Russell, with the recovering Verstappen up to fourth but yet to serve his penalty.\n\n\nAnd how far can Hamilton go on his hards? He's fifth right now."
    },
    {
      "title": "RECAP: Drama at the start",
      "subtitle": "LAP 21/58",
      "text": "Verstappen tried to dive down the inside of Piastri at the start, tagging the McLaren which sent them both spinning. He earned a 10-second time penalty for that move, which he has yet to serve.\n\n\nPiastri dropped to last, and accidentally ran into the back of Colapinto, earning himself a 10-second time penalty.\n\n\nBottas hit Perez who was recovering from his own spin at the start, which earned the Finn a time penalty, and sent Perez into retirement.\n\n\nZhou also has a penalty, for a false start."
    },
    {
      "title": "Top runners yet to pit ",
      "subtitle": "LAP 20/58",
      "text": "Hamilton hasn't pitted yet, the only car to start on the hard tyres. The rest of the front runners need to pit for those hards, which don't look as strong a race tyre as the mediums.\n\n\nThe undercut is a factor here, but Norris should have enough of a lead to counteract it if Ferrari opt to pull Sainz in first."
    },
    {
      "title": "Where are the big names?",
      "subtitle": "LAP 19/58",
      "text": "Norris leads the race for McLaren, Piastri is down in P13 via a collision and a time penalty.\n\n\nSainz is second, Leclerc on a brilliant recovery drive in fourth.\n\n\nRussell is third, Hamilton sixth.\n\n\nAnd Verstappen is fifth, but Perez has retired from the race after a spin and some contact."
    },
    {
      "title": "Gasly and Tsunoda do battle ",
      "subtitle": "LAP 18/58",
      "text": "Tsunoda hasn't pitted yet, so it is admirable that he briefly manages to fight back past Gasly once the Alpine overtook him, but it was a short lived attack. Gasly up to eighth, having pitted when running third.\n\n\nHe has another RB ahead, Lawson five seconds up the road - but the Kiwi also hasn't pitted yet."
    },
    {
      "title": "Norris says his tyres are okay ",
      "subtitle": "LAP 17/58",
      "text": "So, the track has cooled from 33 to 31 Degrees Celsius, with the sun due to set in the next five minutes or so. Norris says his tyres aren't too bad, as he pulls a few more tenths out on Sainz.\n\n\nHis teammate is down in p13, having served his time penalty at the pit stops. He's trying to fight back to Alonso ahead."
    },
    {
      "title": "The top two are clean away ",
      "subtitle": "LAP 16/58",
      "text": "Norris leads by 3.7s from Sainz, those two embroiled in a big constructors' fight tonight. Russell is 10.4s adrift in third, but with some clean air ahead.\n\n\nAlbon didn't false start there, so he is no longer under investigation. Zhou has been penalised though."
    },
    {
      "title": "Gasly pits from P3",
      "subtitle": "LAP 15/58",
      "text": "Alpine have pulled the plug when under pressure from Russell - they bring Gasly in. That's a 2.6s stop which is good, but the hard tyre just doesn't look good based on how Hamilton has coped.\n\n\nGasly comes back out in P10, just behind his teammate who won't hold him up."
    },
    {
      "title": "Norris still leads ",
      "subtitle": "LAP 14/58",
      "text": "These are early stops - are some of the midfield two-stopping tonight? The undercut has worked for Stroll on Magnussen, helped by that slow Haas pit stop.\n\n\nHulkenberg is the next in, and that is a much better stop, just 2.5s. He comes back out ahead of Alonso, who also pitted."
    },
    {
      "title": "Magnussen pits ",
      "subtitle": "LAP 13/58",
      "text": "It's a slow stop for Magnussen, that's not ideal - 7.2s and that undoes all the good work he did at the start.\n\n\nAlbon has been noted for a false start as well.\n\n\nVerstappen picked off Alonso last time around as well. All go here."
    },
    {
      "title": "Norris in clean air ",
      "subtitle": "LAP 12/58",
      "text": "Norris, running in clean air, can manage his tyres out there. Which is an advantage - and he has enough ground on Sainz not to worry about the undercut.\n\n\nFurther back, Hamilton overtook Lawson only to lose the place straight back, Stroll has pitted which promotes the duo one place further on, Hamilton says he has no pace and Leclerc picks off Hulkenberg for fifth."
    },
    {
      "title": "Where is Hamilton?",
      "subtitle": "LAP 11/58",
      "text": "He didn't quite have the same start as Leclerc who was on the mediums, but Hamilton has made progress forward. He's got DRS on Lawson ahead too, and the points are within sight right now.\n\n\nGiven he is on the hards, this race is coming to Hamilton in the sense of battling for points."
    },
    {
      "title": "Norris increases his lead ",
      "subtitle": "LAP 10/58",
      "text": "We will keep saying it, but a win is enough for McLaren. And Norris has extended his lead to 3.3s.\n\n\nZhou has just been noted for a false start, he's down in P13 right now.\n\n\nAs it stands, Gasly will pick up 15 points, Haas 12. Gasly is going to fight very, very hard to stay in third tonight."
    },
    {
      "title": "Piastri gets a penalty ",
      "subtitle": "LAP 9/58",
      "text": "Oh dear - Piastri's race has gone from bad to worse. he now has a 10-second penalty for hitting Colapinto, when he locked up and went into the back of the Williams at the VSC restart. Harsh, but probably fair. Whereas Bottas feels aggrieved by his penalty, as he says he had nowhere to go at the start, and most would agree."
    },
    {
      "title": "What's the situation up front?",
      "subtitle": "LAP 8/58",
      "text": "Norris leads by 2.8s over former team mate Sainz. Gasly is 3.2s further back, surely Alpine can't land another podium this season? They are the only midfield team to have stood on the rostrum.\n\n\nRussell has DRS behind the Frenchman though, in a DRS chain featuring Hulkenberg and Alonso - and Leclerc isn't far away from joining that queue."
    },
    {
      "title": "Piastri's dry sense of humour ",
      "subtitle": "LAP 7/58",
      "text": "\"Move of a world champion that,\" was Piastri's droll remark when he got hit into a spint.\n\n\n\"It hasn't helped [the nerves],\" says Zak Brown on the McLaren pit wall.\n\n\n\"P8, whoooo,\" cries Leclerc, although he is now seventh having picked off Magnussen.\n\n\nIt is all go here."
    },
    {
      "title": "Verstappen at fault for the Lap 1 spin",
      "subtitle": "LAP 6/58",
      "text": "Right - the stewards say Verstappen was at fault for the Lap 1 moment where he tagged Piastri, so he now has a penalty. Bottas also has the same penalty, for hitting Perez."
    },
    {
      "title": "Piastri pits ",
      "subtitle": "LAP 5/58",
      "text": "It's the hard compound tyre for Piastri, in a slow 4.4s stop. He has a dodgy front wing, but McLaren opt not to change that. He will try to go to the end now."
    },
    {
      "title": "Piastri makes contact",
      "subtitle": "LAP 4/58",
      "text": "Piastri just locked up and hit the back of Colapinto's Williams, and now the Argentinian radios to say he has a puncture. That might get looked at, the Bottas - Perez moment has already been noted, as Verstappen and Piastri are under investigation.\n\n\nColapinto pits to get some fresh boots, and it is a slow stop. What a disastrous start to his race. Piastri is also told to pit."
    },
    {
      "title": "What does this all mean?",
      "subtitle": "LAP 3/58",
      "text": "As it stands, Norris winning is enough. Ferrari do not have enough points, although they have two cars in the points. The VSC is ending now, as Haas also have two cars in the points.\n\n\nBut Gasly is third - and he is all over the back of Sainz in the fight for second."
    },
    {
      "title": "The Virtual Safety Car is out",
      "subtitle": "",
      "text": "So, Perez did initially get going after his spin, but he has now pulled to a stop and his car is being wheeled off.\n\n\nBottas is down in P13, he tangled with the Red Bulls at the start. Magnussen is all the way up in seventh, Stroll and Lawson are also in the points."
    },
    {
      "title": "Norris leads the Grand Prix",
      "subtitle": "LAP 2/58",
      "text": "A win is enough for McLaren - 25 points would take the title. But now Norris is a lone wolf up front.\n\n\nThe VSC is out for Perez, who stopped after his spin."
    },
    {
      "title": "Disaster for McLaren",
      "subtitle": "",
      "text": "Piastri is down in P20. Perez has now spun as well, it is wacky races out there. Verstappen looked to tag Piastri but we'll await the replays.\n\n\nNorris leads from Sainz and Gasly!\n\n\nLeclerc is already eighth, Hamilton P12 and now Perez has stopped..."
    },
    {
      "title": "Lights out and off they go! ",
      "subtitle": "",
      "text": "Norris gets a great start from pole, which is just as well as his team mate doesn't get a good start. he's side by side with Verstappen, and Piastri and the Dutchman touch! They both spin! But drop right down the field..."
    },
    {
      "title": "Norris pulls back onto the grid",
      "subtitle": "",
      "text": "It's his eighth pole of the year - and he hasn't always had much luck getting away cleanly from that P1 grid slot.\n\n\nCan Norris lead away here - or is he going to come under pressure from Sainz, his former team mate and best mate, who starts directly behind?"
    },
    {
      "title": "Ready for this one?",
      "subtitle": "",
      "text": "One constructors' title. Plenty of goodbyes. A few loose cannons with nothing to lose.\n\n\nThis race could well be epic this evening..."
    },
    {
      "title": "The Formation Lap",
      "subtitle": "",
      "text": "Off goes Norris, it's not a long run to Turn 1 but that doesn't mean there won't be some action there soon. We've seen plenty of spins on the opening lap here over the years, including some rather famous ones.\n\n\nBut will the McLaren boys keep it clean into Turn 1 when they come back around in a few moments? Surely, surely they are under some form of team orders?"
    },
    {
      "title": "The starting tyres ",
      "subtitle": "",
      "text": "The majority have opted for the medium tyres to start here, but one driver has gone for the hard C3 rubber.\n\n\nAnd that driver is Lewis Hamilton, from P16 on the grid.\n\n\nHe'll be hoping there isn't an early Safety Car then..."
    },
    {
      "title": "McLaren or Ferrari?",
      "subtitle": "",
      "text": "McLaren have the points on the board, and the cars on the front row. They have done everything they can - now it is down to Norris and Piastri to deliver the goods.\n\n\nSainz in third will do his best to disrupt things, but Leclerc down in P19 has a mountain to climb."
    },
    {
      "title": "The grid begins to clear ",
      "subtitle": "",
      "text": "Slowly but surely, the celebrities head to the garages to watch the action, as the fans shuffle in their seats. Anticipation is building, with under ten minutes to go until lights out.\n\n\nConditions are fairly stable, the track temperature is 33 Degrees Celsius and should drop a couple of degrees once the sun sets midway through the race."
    },
    {
      "title": "The strategy ",
      "subtitle": "",
      "text": "According to Pirelli, a one-stop race is in the offing tonight. Which is interesting, as often here two-stops are required.\n\n\nWe could well see a mix of strategies out there, with track position often king here - so a fair few will try for a one-stop regardless of tyre wear."
    },
    {
      "title": "Bottas saves his best until last",
      "subtitle": "",
      "text": "Hamilton might be racing for the last time for Mercedes, but Valtteri Bottas is likely racing for the last time in F1.\n\n\nIf he is, he saved the best until last - with P9 on the grid, saying afterwards that that was as fast as his car can go.\n\n\nHe has never finished a season without a point - can he continue that trend today?"
    },
    {
      "title": "The drivers head to the front ",
      "subtitle": "",
      "text": "It's time for the national anthem, and the drivers have headed to the front of the grid. There's already been a photo with Zak Brown and Fred Vasseur, standing each side of the constructors' trophy.\n\n\nAnd yes, they are still there, pride of place at the front - with everything on the line tonight. And of course Vasseur pretends to steal the trophy at the end..."
    },
    {
      "title": "What can he do from there?",
      "subtitle": "",
      "text": "You can overtake here, and tyre degradation can be quite high. Hamilton recovered from P10 on the grid to second in Las Vegas, but that was when his car was the class of the field.\n\n\nThe Mercedes is going okay here, but not as well as it did in Sin City. He should move forward, but even points in his last race aren't a given."
    },
    {
      "title": "Hamilton's final qualifying ended with bad luck ",
      "subtitle": "",
      "text": "You had to feel for Lewis Hamilton yesterday. He finally felt he had the car underneath him to do something special. He was quicker than his team mate, and genuinely believed he could stick it on the first couple of rows and battle for a podium in his last race for Mercedes.\n\n\nInstead, he ran over a loose bollard on his final lap in Q1, which needless to say did not lead to an improvement. He tumbled out in 18th as a result, although he starts 16th thanks to grid penalties to some others."
    },
    {
      "title": "Who inherits a spot?",
      "subtitle": "",
      "text": "Hulkenberg's penalty demotes him from fourth to seventh, and means rival Gasly now starts ahead rather than behind.\n\n\nVerstappen moves to P4, Gasly to P5 and George Russell to P6, before Hulkenberg slots back in.\n\n\nIt's a blow for Haas for sure, but all is not lost - there will be plenty of opportunities to do something on strategy as well as on the track."
    },
    {
      "title": "Hulkenberg starts seventh ",
      "subtitle": "",
      "text": "Helping Haas is the fact their car has been quick here all weekend long. As demonstrated by Nico Hulkenberg seemingly sticking his VF-24 on the second row for the start of the race.\n\n\nIt was a great lap for the soon to be departing German, but he was then handed a three-place grid drop for overtaking in the pit lane exit. He needs a good race, especially since Pierre Gasly is now starting ahead."
    },
    {
      "title": "The fight for P6",
      "subtitle": "",
      "text": "It's McLaren versus Ferrari for the constructors', but the other fun fight that has bubbled along since Brazil is alpine versus Haas.\n\n\nAlpine have a five point lead over the American outfit - and a higher best finish thanks to that Brazil podium, so Haas need to beat them on points, they can't afford to tie."
    },
    {
      "title": "Perez starts in the top 10",
      "subtitle": "",
      "text": "His team mate is starting in the top 10 as well, Sergio Perez making it to Q3 yesterday. He's under pressure, as he has been all season long.\n\n\nThe rumours are still circulating that this could be his last race, with team boss Christian Horner saying it's up the the Mexican to make the right decision.\n\n\nBut Perez keeps reminding us all he has a contract, and a strong drive here could be enough to silence the doubters."
    },
    {
      "title": "Where is the world champion?",
      "subtitle": "",
      "text": "Max Verstappen qualified fifth for the last race of the year, the first time he hasn't started from pole here since 2019. He has four wins at this track, but might be hard pushed to make it five - the McLarens and Sainz's Ferrari look to have strong race pace.\n\n\nHe has inherited a place due to grid penalties, so now starts fourth - which should make things a little easier."
    },
    {
      "title": "Intra-team tactics at McLaren ",
      "subtitle": "",
      "text": "We have seen teams come a cropper in the last race when the title is on the line. Too often they follow what their rivals are doing, rather than concentrate on their own race.\n\n\nWith two cars right at the front, that shouldn't be too big an issue for McLaren tonight. Provided their drivers behave and don't start battling - or worse, take each other out.\n\n\nThere will surely be some sort of team orders in play for the papaya team tonight, that constructors' title too precious to allow all-out fighting."
    },
    {
      "title": "What happened to Ferrari?",
      "subtitle": "",
      "text": "While Carlos Sainz managed to bag a very respectable third on the grid, Charles Leclerc qualified 14th. Add in his 10-place grid drop and he starts on the back row here.\n\n\nHe lost his lap time in Q2 to track limits, hence the lowly qualifying slot. And one car near the front isn't enough for Ferrari, they needed both scoring big, big points tonight to have a chance of overhauling McLaren."
    },
    {
      "title": "McLaren versus Ferrari ",
      "subtitle": "",
      "text": "McLaren are the team sitting pretty with a sizeable lead of 21 points heading into this race, with a maximum 44 left on the table.\n\n\nAnd the even better news for them is that they locked out the front row yesterday in qualifying.\n\n\nFerrari have one car in third - and the other right down the back, as the chances of their first title since 2008 look to be hanging by a thread."
    },
    {
      "title": "An emotional evening awaits",
      "subtitle": "",
      "text": "The last race of the season is always an emotional one - drivers leaving, drivers moving, the end of an era.\n\n\nBut this one should be especially poignant, given how many drivers are moving on or away from the sport.\n\n\nBut before we get into all of that, there is a constructors' championship still to decide."
    },
    {
      "title": "Welcome back to Abu Dhabi",
      "subtitle": "",
      "text": "It is finally here, the 24th race at the end of a packed calendar. Abu Dhabi is once again playing host to the final round of the season, and what a season it has been..."
    },
    {
      "title": "Overview",
      "subtitle": "",
      "text": "* Round 24 of 24 comes from the Yas Marina Circuit, Abu Dhabi\n * Pole-sitter Lando Norris wins the race [https://www.formula1.com/en/latest/article/norris-sails-to-victory-ahead-of-sainz-and-leclerc-in-abu-dhabi-as-mclaren.52fogZq77Kgmdt75WN8kGM] for McLaren\n * As a result, McLaren win the constructors' title\n * Max Verstappen and Oscar Piastri collide at the first corner [https://www.formula1.com/en/latest/article/race-start-watch-the-chaotic-race-start-at-the-abu-dhabi-gp-as-norris-leads.5f7zBLyCP5D1mz7IPjMr9I], with the Red Bull driver handed a 10-second penalty for the incident\n * Sergio Perez forced to retire on the first lap after a collision with Valtteri Bottas, Franco Colapinto retires on Lap 26\n * Bottas retires on Lap 30 after locking up and crashing into Kevin Magnussen\n * Lewis Hamilton finishes fourth in final race with Mercedes"
    }
  ]
}
